            jr      boot
; ------------------------------------------------------------------------------
defw        iKeyb                   ; IRQ#1 KEYBOARD
defw        iRetrace                ; IRQ#2 VRETRACE
; ------------------------------------------------------------------------------
boot:       ld      sp, $8000
            ld      a, $07
            call    cls
            ld      a, 0x30
            ld      (color), a      ; Каким цветом будет вывод
            ld      hl, $0000       ; Вывести строк в X=0,Y=0
            ld      de, s1
            ld      b, b            ; Активация дебага
            call    pstr
            ld      a, a            ; Деактивировать
            halt
; ------------------------------------------------------------------------------
iKeyb:      in      a, ($FE)
            call    pchar
            inc     l
iRetrace:   reti
; ------------------------------------------------------------------------------
s1:         defb    "X-Tension Cosmic Space Game 2025",0
; ------------------------------------------------------------------------------
include     "zx.asm"
